[
    {
        "title": "Collective Fullstack website",
        "description": "a website for Collective Fullstack, the name that me and one of my friends work under. It was built with Next.JS and is statically generated from markdown files.",
        "href": "https://collective-fullstack.github.io"
    },
    {
        "title":"MathSender",
        "description":"a tool designed to help teachers ask maths questions to students during online learning. MathSender provides a way to send beautiful LaTeX based expressions in real time via a question and answer system.",
        "href":"https://collective-fullstack.github.io/work/MathSender"
    },
    {
        "title":"ERDot",
        "description":"a python CLI script to create Entity Relationship Diagrams from JSON/YAML code.",
        "href":"https://github.com/ehne/ERDot"
    },
    {
        "title": "PyNode Next",
        "description":"PyNode Next allows you to easily create beautiful graph visualisations and animations via a simple Python library. PyNode Next was created as a modern replacement for PyNode, a program used in the teaching of the Victorian Certificate of Education's Algorithmics subject at John Monash Science School.",
        "href":"https://github.com/ehne/PyNode-Next"
    },
    {
        "title": "yOS",
        "description": "a web OS for small programming experiments that don't warrant a full website.",
        "href": "https://yos.vercel.app"
    },
    {
        "title":"Microtext",
        "description":"a library of small (and probably inefficient) utility functions for messing with text.",
        "href":"https://github.com/ehne/microtext"
    },
    {
        "title":"StacksUI",
        "description":"a UI layout library for the web that uses the paradigm of stacks. Inspired by SwiftUI.",
        "href":"https://darcylf.me/StacksUI"
    },
    {
        "title":"JMSS Murder",
        "description":"a fun real life battle royale style game, in which participants had to poke each other with plastic spoons. Created & run at John Monash Science School in 2019.",
        "href":"https://collective-fullstack.github.io/work/JMSS-Murder"
    },
    {
        "title":"darcylf.me",
        "description":"the website that you are currently on. It was built using nextjs, react & github pages.",
        "href":"https://darcylf.me"
    }

]
