[
    {
        "title":"MathSender",
        "icon":"Hash",
        "description":"a tool designed to help teachers ask maths questions to students during online learning. MathSender provides a way to send beautiful LaTeX based expressions in real time via a question and answer system.",
        "href":"https://collective-fullstack.github.io/work/MathSender"
    },
    {
        "title":"ERDot",
        "icon":"Database",
        "description":"a python CLI script to create Entity Relationship Diagrams from JSON code.",
        "href":"https://github.com/ehne/ERDot"
    },
    {
        "title":"Shareify",
        "icon": "Music",
        "description": "a web app that democratizes music in public places. Allowing people to vote on the songs to be played from a Spotify account.",
        "href": "https://github.com/Collective-Fullstack/communalspotify"
    },
    {
        "title":"JMSS time updated",
        "icon":"Clock",
        "description":"an update to the jmss timetable site, it now supports the new timetable introduced in 2020, as well as letting users set custom images to use as the background.",
        "href":"https://jmss-time.github.io/time-updated/"
    },
    {
        "title": "yOS",
        "icon": "Grid",
        "description": "a web OS for small programming experiments that don't warrant a full website.",
        "href": "https://yos.vercel.app"
    },
    {
        "title":"graphX",
        "icon":"Share2",
        "description":"a simple graph theory library for python. Designed to be used with as little pain and confusion as possible. Powered by AlgorithmX. Spiritual successor to Pynode.",
        "href":"https://github.com/ehne/graphX"
    },
    {
        "title":"Microtext",
        "icon":"Type",
        "description":"a library of small (and probably inefficient) utility functions for messing with text.",
        "href":"https://github.com/ehne/microtext"
    },
    {
        "title":"StacksUI",
        "icon":"Layout",
        "description":"a UI layout library for the web that uses the paradigm of stacks. Inspired by SwiftUI.",
        "href":"https://darcylf.me/StacksUI"
    },
    {
        "title":"Leven",
        "icon":"Wind",
        "description":"a simple tweening library to make small animations for python.",
        "href":"https://darcylf.me/leven"
    },
    {
        "title": "Is my browser IE?",
        "icon":"Chrome",
        "description": "a website that answers the question, \"is my browser Internet Explorer?\".",
        "href":"https://darcylf.me/isIE"
    },
    {
        "title":"JMSS Murder",
        "icon":"Zap",
        "description":"a fun real life battle royale style game, in which participants had to poke each other with plastic spoons. Created & run at John Monash Science School in 2019.",
        "href":"https://collective-fullstack.github.io/work/JMSS-Murder"
    },
    {
        "title":"darcylf.me",
        "icon":"Home",
        "description":"the website that you are currently on. It was built using nextjs, react & github pages.",
        "href":"https://darcylf.me"
    }

]
